{
    "meta": [
        "File: <<SBST_RC_sim_talk_grp>> Desc Page-0",
        "File: <<SBST_RC_sim_talk_grp>> Desc Page-1",
        "File: <<SBST_RC_sim_talk_grp>> Desc Page-2",
        "File: <<SBST_RC_sim_talk_grp>> Desc Page-3",
        "File: <<SBST_RC_sim_talk_grp>> Desc Page-4",
        "File: <<SBST_RC_sim_talk_grp>> Desc Page-5",
        "File: <<SBST_RC_sim_talk_grp>> Desc Page-6",
        "File: <<SBST_RC_sim_talk_grp>> Desc Page-7",
        "File: <<SBST_RC_sim_talk_grp>> Desc Page-8",
        "File: <<SBST_RC_sim_talk_grp>> Desc Page-9",
        "File: <<SBST_RC_sim_talk_grp>> Desc Page-10",
        "File: <<SBST_RC_sim_talk_grp>> Desc Page-11",
        "File: <<SBST_RC_sim_talk_grp>> Text Index-0",
        "File: <<SBST_RC_sim_talk_grp>> Text Index-1",
        "File: <<SBST_RC_sim_talk_grp>> Text Index-2",
        "File: <<SBST_RC_sim_talk_grp>> Text Index-3",
        "File: <<SBST_RC_sim_talk_grp>> Text Index-4",
        "File: <<SBST_RC_sim_talk_grp>> Text Index-5",
        "File: <<SBST_RC_sim_talk_grp>> Text Index-6",
        "File: <<SBST_RC_sim_talk_grp>> Text Index-7",
        "File: <<SBST_RC_sim_talk_grp>> Text Index-8"
    ],
    "content": [
        "**AVPL’s Initial Proposal**\nThis proposal outlines a structured approach to control and management across three main areas: Operation Control, Station Control, and Engineering Control. Each area is defined by specific roles, user groups, and levels of expertise.\n. **Operation Control:**\n   - **Call-signs & Personas in Control:** The default is OCC (Operations Control Center), with other roles like TC (Train Controller).\n   - **Users Group:** Primarily CSO (Customer Service Officer) and TPO (Train Protection Officer).\n   - **Levels:**\n     - **Basic Levels:** Focus on communication syntax, habits, and practices, including check-out procedures.\n     - **Intermediate Level:** Involves procedural routines in train operations.\n     - **Advance Level:** Emphasizes handling known incidents.\n. **Station Control:**\n   - **Call-signs & Personas in Control:** Default is SM (Station Manager), with roles like ASM (Assistant Station Manager).\n   - **Users Group:** Mainly CSO (Customer Service Officer).\n   - **Levels:**\n     - **Basic Levels:** Similar communication and procedural practices as Operation Control.\n     - **Intermediate Level:** Focuses on the station’s procedural routines.\n     - **Advance Level:** Involves handling known incidents.\n. **Engineering Control:**\n   - **Call-signs & Personas in Control:** Default is Depot, with roles in engineering.\n   - **Users Group:** Includes EPIC (Engineering Personnel in Charge), engineers, and technicians.\n   - **Levels:**\n     - **Basic Levels:** Similar foundational practices as the other controls.\n     - **Intermediate Level:** Coordination of engineering work routines.\n     - **Advance Level:** Known incident handling.\nThis proposal aims to standardize practices and enhance efficiency across different control areas by defining clear roles and responsibilities at various expertise levels.",
        "Framework for RC Comms SLP Proposed\nThis framework outlines a structured approach for Radio Communication (RC) using a Speech Language Processing (SLP) system, organized into a 3x3 matrix. It is designed to guide AI-driven conversations across different talk groups: Operations, Station, and Depot/Engineering. The framework is divided into three levels of complexity: Basic, Intermediate, and Advance.\n### Talk Groups and Roles\n. **Operations**\n   - **Control**: RAM/AI acts as CONTROL, maintaining character consistency despite call-sign changes (e.g., OCC, TCO1, TCO2).\n   - **Users**: Roles change with call-signs, adopting specific personas (e.g., CSO, TPO, CAR 01).\n. **Station**\n   - **Control**: RAM/AI acts as CONTROL, with consistent character and changing call-signs (e.g., CS, SM).\n   - **Users**: Roles change with call-signs, adopting specific personas (e.g., CAR 01, CSO).\n. **Depot/Engineering**\n   - **Control**: RAM/AI acts as CONTROL, maintaining character consistency with changing call-signs (e.g., Depot 0).\n   - **Users**: Roles change with call-signs, adopting specific personas (e.g., CAR 01, EPIC).\n### Levels of Complexity\n- **Basic Level**\n  - Focuses on identity checking, radio checks, and clarifying communication. It includes unique catchphrases and common terminologies specific to each talk group.\n- **Intermediate Level**\n  - Involves routine procedural sequences with detailed steps for AI, such as obtaining and surrendering TOA (Time of Arrival). It uses acronyms and terminologies specific to each talk group.\n- **Advance Level**\n  - Engages with multiple scenarios and incidents, providing storyboards and additional rules to guide conversations. It includes information references for each scenario.\n### Conversation Types\n- **Basic Conversation Level**: Simple exchanges focusing on identity and position.\n- **Procedural Conversation**: Driven by fixed sequences and routines.\n- **Incident/Event-Based**: Characterized by the nature of incidents or event scenarios.\nThe framework is designed to demonstrate the Proof of Concept (POC) Practice Intent, emphasizing variability in content without being exhaustive.",
        "**SBST RTI - RC Comms Training Design Schema**\nThis diagram outlines a training design schema for RC (Radio Communications) within the SBST RTI framework. It illustrates the progression from a beginner to an experienced user through structured training phases.\n. **Newbie Stage**:\n   - **RC Teaching of Theory**: This initial phase involves learning the basics of radio communication, including protocols, syntax, call-signs, and nomenclatures.\n   - **Modules**:     - #1: Focuses on foundational knowledge.\n     - #2 and #3: Delve deeper into specific areas, possibly involving more complex concepts.\n. **RC Sim Learning & Practice**:\n   - **Basic**: Introduction to practical skills in a simulated environment.\n   - **Intermediate**: Builds on basic skills, incorporating more complex scenarios.\n   - **Advanced**: Prepares trainees for real-world application, focusing on high-level skills.\n. **Qualified Stage**:\n   - After completing the learning and practice phases, individuals become qualified.\n   - **RC Experienced & Power User**: This stage signifies a high level of proficiency and expertise in radio communications.\n. **Rehabilitative Training**:\n   - Allows for retraining or transitioning to different talk-groups, ensuring skills remain current and adaptable.\nThe schema is divided into two main sections: TT (Theory Training) and SLP (Simulated Learning & Practice), with a point of contact (POC) for further guidance. This structured approach ensures a comprehensive development of skills from theory to advanced practice.",
        "**SBST - Feedback (End March 2024)**\nThis content outlines the structure of pre-defined talk groups based on user profiles. These groups are designed to facilitate communication and learning among different user categories, with the option for users to access additional groups if they wish to expand their knowledge.\n**User Categories and Talk Groups:**\n. **Maintenance Staff:**\n   - **Talk Groups:**\n     - Train Ops\n     - Track Access\n     - Maintenance\n. **CSO, ASM, SM:**\n   - **Talk Groups:**\n     - Train Ops\n     - Track Access\n     - Operations\n. **TC, DTC:**\n   - **Talk Group:**\n     - OCC (Operations Control Center)\n     - This group essentially covers the roles of talk groups 1 to 4 but with a reverse role as OCC.\nThe structure is designed to ensure that each user category has access to relevant communication channels, enhancing operational efficiency and knowledge sharing.",
        "SBS Transit RC Comm Chat Bot\nThis image introduces the SBS Transit RC Comm Chat Bot, a tool designed to simulate communication through a Tetra radio set. The interface features a realistic depiction of a Tetra radio, complete with buttons and a microphone icon indicating where to press to talk. The purpose of this chat bot is to provide a learning experience by allowing users to practice speaking as if they are using an actual Tetra radio. The background is a gradient of purple hues, and there is a \"Back\" button for navigation. The logo of SBS Transit is prominently displayed, indicating the association with the transit service.",
        "**Choosing a Talk Group: Progression from Basic to Advanced**\nThis visual guide is designed to help users select a talk group for practice, progressing through different levels of complexity: Basic, Intermediate, and Advanced.\n- **Basic Level**: The top row consists of five green circles, each representing a different talk group. This level is ideal for beginners who are just starting their practice.\n- **Intermediate Level**: The middle row also contains five green circles. These are for users who have gained some proficiency and are ready to tackle more challenging discussions.\n- **Advanced Level**: The bottom row features five darker green circles, indicating the most complex talk groups. This level is suited for users who have mastered the basics and intermediate levels and are ready for advanced practice.\nAt the bottom, there are five categories labeled as follows:\n. **Train Ops**: Focuses on train operations.\n. **Track Access**: Deals with accessing and managing tracks.\n. **Maintenance**: Covers maintenance-related discussions.\n. **Operations**: Encompasses general operational topics.\n. **OCC**: Refers to the Operations Control Center.\nThis structured approach allows users to gradually build their skills by starting with basic concepts and advancing to more complex topics.",
        "**Finalised SLP Framework**\nThis framework outlines the structure and roles within different talk groups for a communication system, focusing on train operations and related activities. It is divided into five main talk groups, each with specific roles and users.\n### Talk Groups\n. **Train Ops**\n   - **AI Role**: Assumes the role of OCC (Operations Control Center) with a consistent character model.\n   - **Callsigns**:\n     - TC (Train Controller): \"Mainline zero one\" or \"Mainline zero two\"\n     - DTC (Depot Train Controller): \"Depot zero\"\n   - **Users**: PV (Passenger Vehicle) and loco drivers\n     - Callsign for PV: Car number (e.g., \"Car two five\")\n     - Callsign for loco: Consist and consist number (e.g., \"Loco zero one\")\n. **Track Access**\n   - **AI Role**: Assumes the role of OCC with a consistent character model.\n   - **Callsigns**:\n     - TC: \"Mainline zero one\" or \"Mainline zero two\"\n     - DTC: \"Depot zero\"\n   - **Users**: TPO (Track Protection Officer) and PC (Protection Coordinator)\n     - Callsign for TPO: TPO and name (e.g., \"TPO George\")\n. **Maintenance**\n   - **AI Role**: Assumes roles of OCC, maintenance staff, and loco driver with new character models for maintenance staff and loco driver.\n   - **Callsigns**:\n     - Job title and name (e.g., \"PFR Tan\", \"SDS David\")\n   - **Users**: WC/MCO, PFR, SDS, OSC, TMC\n. **Operations**\n   - **AI Role**: Assumes the role of OCC with a consistent character model.\n   - **Callsigns**:\n     - TC: \"Mainline zero one\" or \"Mainline zero two\"\n     - DTC: \"Depot zero\"\n   - **Users**: CSO (Customer Service Officer), ASM (Assistant Station Manager), SM (Station Manager)\n     - Callsign for CSO: Job title and name (e.g., \"CSO Kenny\")\n     - Callsign for station: Station and job title (e.g., \"Sengkang SM Muthu\")\n. **OCC**\n   - **AI Role**: Assumes roles from talk groups 1 to 4.\n   - **Callsigns**:\n     - TC: \"Mainline zero one\" or \"Mainline zero two\"\n     - DTC: \"Depot zero\"\n   - **Users**: TC and DTC\n### Skill Levels\n- **Basic**:  - Operating words, call signs, phonetics, numbers\n  - Radio discipline (message structure, seeking clarification, individual vs. group call, etc.)\n- **Intermediate**:  - Routine radio communications specific to each talk group.\n- **Advance**:  - Incident or accident scenarios related to each talk group.\nThis framework ensures structured communication and role clarity across different operational areas, enhancing efficiency and safety.",
        "**Demo Projection - Live Mirroring on TV**\n introduces a demonstration of live mirroring on a TV. Live mirroring involves displaying the content from a device, such as a smartphone or computer, onto a television screen in real-time. This can be useful for presentations, sharing media, or enhancing viewing experiences by using a larger display. The process typically involves connecting the device to the TV via a wired connection like HDMI or wirelessly through technologies such as Chromecast, AirPlay, or Miracast.",
        "**Choose a Talk Group: Start Practicing from Basic to Intermediate, then Advance**\nThis interface is designed to help users practice communication skills by selecting different talk groups. The layout is organized into three levels of difficulty: Basic, Intermediate, and Advanced. Each level contains a series of green buttons, likely representing different topics or modules within that level.\n- **Basic Level**: The first row of green buttons is for beginners, providing foundational practice.\n- **Intermediate Level**: The second row offers a moderate challenge, building on the basic skills.\n- **Advanced Level**: The third row is for advanced practice, likely involving more complex scenarios.\nAt the bottom, there are navigation buttons for different categories or functions:\n- **Back**: Likely returns the user to a previous screen.\n- **Train Ops, Track Access, Maintenance, Operations, OCC**: These buttons suggest different areas of focus or departments, possibly related to specific training or operational contexts.\nThis setup encourages a structured progression through communication skills, starting from basic concepts and advancing to more complex interactions.",
        "**Basic Level Practice**\nThis section focuses on basic communication practices and habits for radio communication (RC) comms. It is designed to reinforce what has been learned in previous modules, with a focus on call-signs and message context.\n**Good Comms Practices and Habits:**\n. **Making a Group Call (only by control centre, not individuals):**\n   - The sender initiates the call by stating the receiver's call sign, followed by their own call sign and the message.\n   - Example: \"<Receiver’s Call Sign> this is <Sender’s Call Sign>, <Message>, over\"\n   - Example: \"<Car 45> this is <Mainline 01>, <Message>, over\"\n. **Individuals Establishing a Call:**\n   - When a receiver's radio call alert sounds, the receiver responds by acknowledging the call sign and indicating readiness to receive the message.\n   - Example: \"<Receiver’s Call Sign>, send, over\"\n   - Example: \"<Car 45>, send, over\"\n. **Subsequent Radio Messages:**\n   - Messages exchanged between the receiver and sender should start with the sender's call sign and end with \"over.\" The final message should end with \"out.\"\n   - Example: \"<Your own Call Sign> <Your Message>, over\"\n   - Example: \"<Car 45>, <Message>, over\"\n. **Leaving Radio Comms:**\n   - The sender concludes communication by ending with \"over and out.\"\n   - Example: \"<Your own Call Sign> <Your Message>, over and out.\"\n   - Example: \"<Car 45>, <Message>, over and out.\"\nThese practices ensure clear and effective communication in radio operations.",
        "**Radio Communication Protocol**\nThis image illustrates a conversation using a radio communication protocol. The exchange involves a player and a control center, highlighting the importance of using specific procedures for clarity and identification.\n. **Initiation**: The player begins with a simple greeting, \"Hello.\"\n. **Control Center Response**: The control center responds by reminding the player to start messages with \"TPO\" for clarity and to follow the radio communication protocol. This ensures that messages are clear and properly formatted.\n. **Identification Request**: The control center requests the player to provide a call sign for identification purposes. This is crucial in radio communications to ensure that all parties are correctly identified and messages are directed appropriately.\n. **Reiteration**: The control center repeats the request for the call sign, emphasizing the need for proper protocol adherence.\nThe image also features a Tetra Radio, which is a type of communication device used in professional settings for secure and reliable communication. The visual emphasizes the importance of using standardized communication methods in radio operations.",
        "The image shows a smartphone displaying a communication interface that resembles a radio system. The screen includes a conversation between a \"Player\" and \"Ram,\" who appears to be a control center operator. The dialogue emphasizes the importance of using proper communication protocols, specifically mentioning \"TOP\" for clarity and identification.\nIn the center of the screen, there is an image of a TETRA radio device, which is commonly used for secure and reliable communication in professional settings. The bottom of the phone screen features the logo of \"SBS Transit,\" suggesting a connection to a transportation service.\nThe overall theme of the image is about maintaining clear and effective communication, likely in a transit or operational context, using both digital and traditional radio methods.",
        "AVPL’s Initial Proposal :\nFramework for RC Comms SLP proposed :\nTALK-\nGROUPS\nOperations\nStation\nDepot / Engineering\nCONTROL\nRAM / AI assumes the role of CONTROL -and the character do not change,although its Call-sign changes.OCC, TCO1, TC02.\nRAM / AI assumes the role of CONTROL -and the character do not change,although its Call-sign changes.CS, SM,\nRAM / AI assumes the role of CONTROL -and the character do not change,although its Call-sign changes.Depot 0,\nUSERS\nUser’s role changes along with call-signand takes on that persona, and hencecontext:CSO, TPO, CAR 01 etc . .\nUser’s role changes along with call-signand takes on that persona, and hencecontext:CAR 01, CSO, etc.\nUser’s role changes along with call-signand",
        "and hencecontext:CAR 01, CSO, etc.\nUser’s role changes along with call-signand takes on that persona, and hencecontext:CAR 01, EPIC, etc.\nBasic Level\nChecking in (identity) and Radio CheckChecking out, Clarifying, Repeating, TimeLocation or Position relevant, andterminologies:• List A1 - Unique Catchphrases in\nChecking in (identity) and Radio CheckChecking out, Clarifying, Repeating, TimeLocation or Position relevant, andterminologies:• List A2 - Unique Catchphrases in Station\nChecking in (identity) and Radio CheckChecking out, Clarifying, Repeating, TimeLocation or Position relevant, andterminologies:• List A3 - Unique Catchphrases  in\nOperations\nControl\nDepot/Engineering\n• Use of Common Catchphrases\nRoutine procedural sequences titled anddetails of step provided to AI:• Obtaining TOA• Track entry• Surrendering TOAUse of acronyms",
        "to AI:• Obtaining TOA• Track entry• Surrendering TOAUse of acronyms and terminologiesapplicable to talk groups List B1\nMultiple scenarios and incidentsstoryboard provided to AI as a guide, with• Additional rules (guides conversation)• Information References for each\nIntermediate\nAdvance\n• Use of Common Catchphrases\nRoutine procedural sequences titled anddetails of step provided to AI:• Provide in Pilot phase ?Use of acronyms and terminologiesapplicable to talk groups List B2\n• Use of Common Catchphrases\nRoutine procedural sequences titled anddetails of step provided to AI:• Provide in Pilot phaseUse of acronyms and terminologiesapplicable to talk groups List B3\nMultiple scenarios and incidentsstoryboard provided to AI as a guide, with• Additional rules",
        "incidentsstoryboard provided to AI as a guide, with• Additional rules (guides conversation)• Information References for each\nMultiple scenarios and incidentsstoryboard provided to AI as a guide, with• Additional rules (guides conversation)• Information References for each\nCharacterised bynature of incidents orevent scenarios\nThe AI Bot will lead in the conversationbase on the selected Practice withinthe organised 3x3 matrix framework. The variability of content is notintended to be extensive andexhaustive at POC, as it is ONLY toshow the POC Practice Intent.\nConversation Types:\nBasic conversationlevel\nProceduralconversation drivenby fixed sequence &routines\nSBST RTI - RC Comms Training Design Schema\nNewbie\nRC Teaching ofTheory\nRC Sim Learning &Practice\nQualiﬁed\nRC Experienced &Power User\n# 1\n# 2\n# 3\nProtocols,Syntax,",
        "ofTheory\nRC Sim Learning &Practice\nQualiﬁed\nRC Experienced &Power User\n# 1\n# 2\n# 3\nProtocols,Syntax, etc.\nCall-signs,Nomenclatures\nBasic\nIntermediate\nAdvance\nTT\nSLP - POC\nRehabilitative Training, or crossingto diﬀerent talk-group\nSBST - Feedback end March 2024\nPre-defined talk groups based on user profile selected. Other talk groups are optional but may stillbe accessed by user should he want to learn more.\nMaintenancestaff\nCSO, ASM,SM\nPre-defined talk groups\n. Train Ops\n. Track access\n.Maintenance\n. Train Ops\n. Track access\n. Operations\nTC, DTC\n. OCC\nEssentially talk groups 1 to4 but reverse role as OCC\nWelcome to the SBST RC Comm Chat Bot. \nLearn as you speak through it . . as if using the Tetra set !\nPress to talk\nBack\nC h o o s e ",
        "set !\nPress to talk\nBack\nC h o o s e   a   t a l k   g r o u p :   s t a r t   p r a c t i c i n g   f r o m B a s i c   t o   I n t e r m e d i a t e ,   t h e n   A d v a n c e .\nBASIC\nINTERMEDIATE\nADVANCE\nTrain Ops\nTrack access\nMaintenance\nOperations\nOCC\nLanding page of SLP Application\nTalk Groups\n. Train Ops\nFinalised",
        ".\nBASIC\nINTERMEDIATE\nADVANCE\nTrain Ops\nTrack access\nMaintenance\nOperations\nOCC\nLanding page of SLP Application\nTalk Groups\n. Train Ops\nFinalised SLP Framework\n. Track access\n. Maintenance\n. Operations\n. OCC\nAI assumes the role of OCC.Same character model.\nAI assumes the role of OCC.Same character model.\nTC callsign: Mainline zeroone or Mainline zero two\nTC callsign: Mainline zeroone or Mainline zero two\nAI assumes role of OCC,maintenance staff , locodriver\nSame character model forOCC\nAI assumes the role of OCC.Same character model.\nTC callsign: Mainline zeroone or Mainline zero two\nAI assumes roles from talkgrps 1 to 4. (i.e. Trainoperator, TPO/PC,maintenance staff, Ops staff)\nDTC callsign: Depot zero\nDTC callsign: Depot zero\nDTC callsign: Depot zero\nUsers\nPV and loco drivers\nTPO and PC\nCallsign for PV: Car no.",
        "zero\nUsers\nPV and loco drivers\nTPO and PC\nCallsign for PV: Car no. (e.g.Car two five)\nCallsign for TPO: TPO +name (e.g. TPO George)\nCallsign for loco: Consist +consist no. (E.g. Loco zeroone)\nCallsign for TPO: TPO +name (e.g. TPO George)\nNew character model formaintenance staff and locodriver\nWC/MCO, PFR, SDS, OSC,TMC\nCallsign: Job title + name (e.g. PFR Tan,  SDS David,OSC Ismail, TMC Suhaimi)\nCSO, ASM, SM\nTC and DTC\nCallsign for CSO: Job title +name (e.g. CSO Kenny)\nCallsign for TC: Mainline zeroone or Mainline zero two\nCallsign for station: Station +job title + name (e.g.Sengkang SM Muthu)\nCallsign for DTC: Depot zero\nBasic\n• Operating words, call signs, phonetics, numbers• Radio discipline (message",
        "zero\nBasic\n• Operating words, call signs, phonetics, numbers• Radio discipline (message structure, seeking clarification, individual vs group call, etc..)\nIntermediate Routine radio\ncommunications specific totalk group (Train Ops).\nRoutine radiocommunications specific totalk group (Track access).\nRoutine radiocommunications specific totalk group (Maintenance).\nRoutine radiocommunications specific totalk group (Operations).\nRoutine radiocommunications specific totalk group (OCC).\nAdvance\nIncident or accidentscenarios related to talkgroup (Train Ops).\nIncident or accidentscenarios related to talkgroup (Track access).\nIncident or accidentscenarios related to talkgroup (Maintenance).\nIncident or accidentscenarios related to talkgroup (Operations).\nIncident or accidentscenarios related to talkgroup (OCC).\nDemo Projection - Live Mirroring on TV\nRC Comm SLP\nBack\nBack\nRC Comm SLP"
    ]
}