{
    "meta": [
        "File: <<SBST RC Comms SLP>> Desc Page-0",
        "File: <<SBST RC Comms SLP>> Desc Page-1",
        "File: <<SBST RC Comms SLP>> Desc Page-2",
        "File: <<SBST RC Comms SLP>> Desc Page-3",
        "File: <<SBST RC Comms SLP>> Desc Page-4",
        "File: <<SBST RC Comms SLP>> Desc Page-5",
        "File: <<SBST RC Comms SLP>> Desc Page-6",
        "File: <<SBST RC Comms SLP>> Desc Page-7",
        "File: <<SBST RC Comms SLP>> Desc Page-8",
        "File: <<SBST RC Comms SLP>> Desc Page-9",
        "File: <<SBST RC Comms SLP>> Desc Page-10",
        "File: <<SBST RC Comms SLP>> Text Index-0",
        "File: <<SBST RC Comms SLP>> Text Index-1",
        "File: <<SBST RC Comms SLP>> Text Index-2",
        "File: <<SBST RC Comms SLP>> Text Index-3",
        "File: <<SBST RC Comms SLP>> Text Index-4",
        "File: <<SBST RC Comms SLP>> Text Index-5",
        "File: <<SBST RC Comms SLP>> Text Index-6",
        "File: <<SBST RC Comms SLP>> Text Index-7",
        "File: <<SBST RC Comms SLP>> Text Index-8",
        "File: <<SBST RC Comms SLP>> Text Index-9",
        "File: <<SBST RC Comms SLP>> Text Index-10",
        "File: <<SBST RC Comms SLP>> Text Index-11",
        "File: <<SBST RC Comms SLP>> Text Index-12",
        "File: <<SBST RC Comms SLP>> Text Index-13",
        "File: <<SBST RC Comms SLP>> Text Index-14",
        "File: <<SBST RC Comms SLP>> Text Index-15",
        "File: <<SBST RC Comms SLP>> Text Index-16",
        "File: <<SBST RC Comms SLP>> Text Index-17",
        "File: <<SBST RC Comms SLP>> Text Index-18",
        "File: <<SBST RC Comms SLP>> Text Index-19",
        "File: <<SBST RC Comms SLP>> Text Index-20",
        "File: <<SBST RC Comms SLP>> Text Index-21",
        "File: <<SBST RC Comms SLP>> Text Index-22",
        "File: <<SBST RC Comms SLP>> Text Index-23",
        "File: <<SBST RC Comms SLP>> Text Index-24",
        "File: <<SBST RC Comms SLP>> Text Index-25",
        "File: <<SBST RC Comms SLP>> Text Index-26",
        "File: <<SBST RC Comms SLP>> Text Index-27",
        "File: <<SBST RC Comms SLP>> Text Index-28",
        "File: <<SBST RC Comms SLP>> Text Index-29",
        "File: <<SBST RC Comms SLP>> Text Index-30",
        "File: <<SBST RC Comms SLP>> Text Index-31",
        "File: <<SBST RC Comms SLP>> Text Index-32",
        "File: <<SBST RC Comms SLP>> Text Index-33",
        "File: <<SBST RC Comms SLP>> Text Index-34",
        "File: <<SBST RC Comms SLP>> Text Index-35",
        "File: <<SBST RC Comms SLP>> Text Index-36"
    ],
    "content": [
        "POC Project for SBST on RC COMMS Training\n**OBJECTIVE**\nThe goal is to develop a cloud-based trainer for RC Communications using LLM AI. This trainer aims to:\n- Enable trainees to learn and practice efficient communication using TETRA Hand Portable Radio.\n- Help trainees develop correct voice protocols and good habits to follow the rules and procedures for radio communications in the SBST Rail operating environment.\n- Facilitate self-learning.\n**APPROACH**\nThe SBST Rails' use of RC Communications over TETRA covers the entire company operations. For effective simulation training, it is organized into three main groups, known as talk-groups:\n. **Operation Control**\n. **Station Control**\n. **Engineering Control**\nThe training will cover the full spectrum of operations, from beginners to full competency. It will involve understanding use cases, learning progression, and specific language used in each talk-group.\nThe training system will be built using a framework that includes:\n- Induction into the theory of RC communications, including syntax, sentence structure, and common phrases.\n- Traditional interactive teaching modules.\nA demonstration of this concept will be part of the Proof of Concept (POC), with full functionality developed later.\nThe RC AI-assisted Sim Learning and Practice (RC AI SLP or 'RC-SLP') will be developed in this POC, following this framework.\n**Talk-Group Details:**\n- **Operation Control:**\n  - Call-signs & Personas: OCC (default), TC, etc.\n  - Users group: CSO (Default), TPO, etc.\n- **Station Control:**\n  - Call-signs & Personas: SM (default), ASM, etc.\n  - Users group: CSO (Default), etc.\n- **Engineering Control:**\n  - Call-signs & Personas: Depot (default), Engineering, etc.\n  - Users group: EPIC (default), Engineer, technician, etc.",
        "**Training and Auditing in RC Sim**\nThe document outlines a structured approach to training personnel in communication practices across different levels of proficiency. It uses a 3x3 matrix to illustrate the progression:\n. **Basic Levels**: Focuses on communication syntax, habits, practices, and check-out procedures, applicable to all except call-signs.\n  2. **Intermediate Level**: Covers procedural routines in train operations, station procedures, and engineering work coordination.\n. **Advanced Level**: Emphasizes known incident handling across various scenarios.\nThe goal is to ensure individuals master communication in their specific operating scenarios, allowing for a more multidisciplinary conversational context within the AI platform.\n**Auditing Functions**\nThe document also discusses the need for auditing functions within the system, driven by the requirement for SBST to submit monthly audit reports of communication transcripts. A pilot run will assess the accuracy of Voice-to-Text transcription using AI, focusing on:\n- Misuse of call-signs\n- Incorrect protocol and verbiage\n- Poor communication clarity\nThe limitations of AI in handling transcription due to user accents and speech are acknowledged. The auditor's role is to resolve context problems and ensure clarity.\n**Deliverable Modules in RC Sim**\n**A) Teaching Portion - RC Comms Theory (only in PILOT Phase):**\n. **Semi-duplex Communication**: Explaining rules and examples, such as allowing pauses between speakers.\n  2. **Keywords and Phrases**: Understanding and using acronyms, abbreviations, and their meanings.\n. **Phonetics and Numbers**: Proper pronunciation and timing.\n. **Operating Groups**: Introduction to different groups and call-signs used in various settings.\n. **Sentence Structure and Syntax**: Learning through examples of forms and formats.\n. **Technical Jargon**: Understanding specific terms through reading and visual aids.\nThe training will eventually include interactive video/audio modules and may extend to TETRA handset hardware.",
        "**RC SLP (POC’s Core)**\nThe RC SLP is divided into three communication talk-groups: Station Manager Control, Engineering Control, and OCC. These groups are featured on the User App Landing Page, each with a designated AI persona and avatar.\n**Training Levels:**\n. **Basic Levels:**\n   - Focus on initial check-ins, communication checks, and simple tasks like asking for permission and checking out with correct call-signs.\n. **Intermediate Level:**\n   - Involves standard work routines and contextual rules programmed in AI. Trainees will learn practices such as wait times and responding to pause requests, ensuring they meet requirements and expectations.\n. **Advanced Level (POC Sampled):**\n   - AI selects from pre-loaded storyboards for simulated scenarios, such as a train defect incident. The scenario involves expected event sequences and responses from involved parties like OCC and CSO.\n**Scope of POC**\nThe SLP Trainer is designed for trainees to conduct RC communications using an AI Chat Bot via a smartphone app. It creates scenarios with dialogue parties, each driven by AI, assuming different personas. The AI adapts to the trainee's chosen lesson plan, following learned voice protocols and practices, prompting trainees to do the same.\n**Development Perspective: \"Users\"**\n- **Operation Control:**\n  - Call-signs: OCC (default), TC, etc.\n  - Users: CSO and TPO\n  - Basic Levels: Complete\n- **Station Control:**\n  - Call-signs: SM (default), ASM, etc.\n  - Users: CSO\n  - Basic Levels: Complete\n- **Engineering Control:**\n  - Call-signs: Depot 01 (default), etc.\n  - Users: EPIC\n  - Basic Levels: Complete",
        "General Rules for the SLP Trainer\nThis section outlines the essential communication protocols for the SLP Trainer, focusing on radio communication rules and procedures:\n. **Identification**: All parties must use discrete call-signs for identification.\n. **Communication Protocol**: Practice 2-way, half-duplex communication, allowing only one party to speak at a time, with a 2-second pause before the next party speaks.\n. **Message Clarity**: Messages should be clear, concise, and to the point to ensure understanding and allow for clarification if needed.\n. **Radio Protocol**: Standard radio protocol must be used at all times.\n. **Language**: All radio messages must be in English, and expletives are prohibited.\n. **Acronyms**: Only use authorized acronyms as per the comms manual.\n. **Need-Based Communication**: Radio comms should be used only when necessary, especially for technical and operational coordination.\n. **Radio Check**: Used to verify connection when entering a new talk group, particularly important in specific situations like switching channels.\n. **Read Back**: Critical work messages must include a \"Read Back\" to confirm understanding.\n. **Addressing**: Messages for manual train movement must be sent to one addressee only, using the Read Back protocol.\n. **Emergency Calls**: Misuse of emergency calls is prohibited.\n. **Registration**: Staff must register their radio number with the appropriate control before commencing duties.\n. **Initial Contacts**: Users must identify themselves and state the purpose of the call when contacting Control.\nThese rules, along with other relevant terminologies, will be integrated into the SLP Trainer to ensure effective communication training.\nHardware, Firmware and Cloud Support\nThe system requirements for the POC Project for an operation training chatbot are based on the desired complexity and flexibility, along with the necessary technologies.",
        "**Proposed Support and Hardware Specifications**\n. **Development Machine**:   - A standard desktop computer with a core i7 processor, 32GB RAM, and a solid-state drive (SSD) running Windows 11 OS is recommended for development purposes.\n   - For training large language models (LLM), a computer with a dedicated NVIDIA GPU, such as GeForce GTX, is beneficial for accelerating the training process.\n. **Development Tools**:\n   - The choice of tools depends on the final development decision. Currently, services like Chat GPT are used for texting LLM.\n   - Specific Python programming tools and code editors are not necessary for the proof of concept (POC).\n. **Internet Connection**:\n   - A reliable and reasonably fast connection is sufficient for internal training deployment.\n   - For POC, cloud hosting is intended, and requirements may change for final deployment.\n   - No need for a web-based interface at this stage.\n. **Text Editors/IDEs**:\n   - Crucial for future development, these should match the programming language used.\n**Trainer Construction for AI Chat Bot Communication**\n- The trainer is designed for trainees to conduct remote communication (RC) with an AI Chat Bot via a smartphone application.\n- Scenarios are created with AI-driven personas in different talk-groups.\n- The user interface (UI) and user experience (UX) provide identity when a lesson or scenario is chosen.\n- The AI follows voice protocols, prompting trainees to do the same.",
        "**Practice Portion - Levels of Practices Defined**\nThis section outlines three levels of practice training that are consistent across three talk-groups. The SLP (Structured Learning Program) will provide corrections to the trainer dialogue as demonstrated in the table.\n- **Player (TPO) and Chatbot AI (as OCC) Interactions:**\n  - If the player fails to identify themselves, the AI prompts them to identify or say their call-sign.\n  - When the player uses a call-sign, the AI requests proper voice protocol and reminds them to say \"Over\" after finishing.\n  - If the player mentions a station, the AI asks for proper numerical phonetics.\n  - For recognition needs, the AI prompts for proper phonetics.\n**Basic Level Practice**\nThis practice level is uniform across the three talk-groups, with slight variations in call-signs and message context. It focuses on practicing what was learned in the teaching module.\n**Good Comms Practices and Habits**\n- **Basic Comms Syntax and Sentence Structure in RC Comms:**\n  A) **Making a Group Call** (only by control center, not individuals):\n  - Format: `<Receiver’s Call Sign> this is <Sender’s Call Sign>, <Message . . >, over`\n  - Example: `<Car 45> this is <Mainline 01>, <Message . . >, over`\n  B) **Individuals Establishing a Call**:\n  - Receiver’s radio call alert sounds, and the receiver responds with: `<Receiver’s Call Sign>, send, over`\n  - Example: `<Car 45>, send, over`\n  C) **Subsequent Radio Messages**:\n  - Start with your call sign and end with \"out\".\n  - Format: `<Your own Call Sign> <…Your Message… >, over`\n  - Example: `<Car 45>, <Message . . >, over`\n  D) **Leaving Radio Comms**:\n  - End with \"over and out\".\n  - Format: `<Your own Call Sign> <…Your Message… >, over`\nThese practices ensure clear and effective communication in radio comms.",
        "**RC Voice Communication Guidelines**\n**When Talking:**\n- Maintain a natural rhythm.\n- Keep a constant speed, slightly slower than in normal conversation.\n- Speak every word clearly, ensuring the voice does not fade away, and avoid shouting.\n- Use a higher pitch tone for better transmission.\n**Guides for User for Good RC Comms:**\n- **Specify Purpose of Call:** Clearly state the reason for the call, such as asking for permission to enter a track. Examples include:\n  - Doing maintenance, repair, or searching for an item.\n  - Responding to rescue a train.\n  - Following orders or instructions with authority.\n- If the purpose is vague or details are incomplete, the AI agent at the Control Centre will prompt for specifics like:\n  - When? (specific time or minutes from the present time)\n  - Where? (present location)\n  - Number of personnel?\n  - Reason for the call.\n**Other Voice Protocol and Practices:**\n- Avoid being too apologetic or using excessive niceties. Control will terminate the call with \"Over and Out\" to prevent recurring counter acknowledgments.\n**Response by Control (Control Centre Persona):**\n- Follow proper voice protocol and be open to corrections.\n- Lead the dialogue in intended scenarios, such as seeking track access. The OCC must provide:\n  - TOA number.\n  - Time limit (in minutes or up to a specific time).\n  - Method of Track Access Protection.\n  - Reminders to TPO to update progress.\n**Practices in RC Voice Comms:**\n- Use structured communication practices:\n  - Order of Phraseology: Start with the call in the Party, followed by oneself, and end with \"over.\"\n  - Keep conversations clear and brief, practicing affirmation and confirmation.\n- Make relevant reminders.",
        "**Communication Protocols in Half-Duplex Systems**\nIn half-duplex communication, only one person can talk at a time. It's crucial for parties to practice a 2-second spacing and speak only when the other party says \"over\" or \"out.\"\n**Key Terms and Phrases:**\n- **Common Catch Phrases/Words:**\n  - Negative, Positive, Wilco, Roger, go-ahead, copy that\n  - Say again, Affirmative, at location/position\n  - Request additional time, extension, use as TOA\n- **Trade Specific Terminologies:**\n  - Referrals: OCC, TPO\n  - Situations: Train disruption, trespassing, intrusions, SPAD, inclement weather, equipment malfunction, track damage\n**Using \"OVER\" and \"OUT\":**\n- **OVER**: Indicates the end of your message, allowing the other party to respond.\n- **OUT in Group Call (Open Channel)**: Ends your conversation, allowing others in the group to communicate.\n- **OUT in Individual Call**: Ends the conversation with no further reply needed.\n**Read Back Message Practice:**\nThis practice ensures messages are correctly understood and received, especially in these situations:\n. Safety situations\n. Protection arrangements\n. Possession and worksite boundaries\n. Change of vehicle operation modes (AM, CM, RM)\n. Movements of vehicles\n. Position of switch (Normal or Reverse)\n. OCS status ON/OFF\nThis protocol ensures clear and effective communication, especially in critical operations.",
        "Intermediate Level Training\nThis training phase builds on the voice communication habits and practices established in the Basic Level. It is structured into three main talk-groups, focusing on different Standard Operating Procedures (SOPs) and standardized processes. The training is designed to enhance skills in specific areas:\n### Operations\n- **Seeking Permission for Track Access**: This involves obtaining authorization to access tracks during traffic hours.\n- **Moving Locomotive onto Tracks**: Procedures for safely moving locomotives onto the tracks.\n### Station Control\n- **Validating Authorization for Access**: Ensuring proper permissions are in place for access.\n- **Arrangements for Visits**: Organizing and managing visits to the station.\n- **Closure of Stations/Entrances**: Procedures for closing stations or entrances as needed.\n### Depot/Engineering\n- **P-way Maintenance**: Focused on maintenance of permanent ways (tracks).\n### Example of Intermediate Level Practices\n**Specific Sequences of Communications with OCC (Track Access):**\nThis involves a sequence of events that vary depending on track protection methods. After obtaining Track Occupancy Authority (TOA), the steps include:\n. Move to the platform and board the assigned train.\n. Make way to enter the restricted area.\n. Enter the track.\n. Report the start of work and provide regular updates.\n. Report work completion.\n. Report leaving the track.\n. Report giving up (surrendering) TOA.\nThis structured approach ensures safety and efficiency in operations and maintenance activities.",
        "**Advance Level Training**\nThis training focuses on enhancing the relevance of responses to events, incidents, or emergencies. It uses storyboards for each scenario, which are uploaded into an AI model to guide the AI Bot in the Sequence of Learning Process (SLP). Here are some examples of situations covered:\n- **Operations Situations:**\n  - SPAD (Signal Passed at Danger)\n  - Inclement weather\n- **Station Control Situations:**\n  - Train disruption\n  - Trespassing\n  - Intrusions\n- **Depot / Engineering Situations:**\n  - Track damage\n  - Point machine malfunction\nThe training also includes work practices for both intermediate and advanced levels, which are crucial for handling incidents or events effectively.\n**Work Practices for Intermediate and Advanced Level Training:**\n- **Communication Devices:**\n  - Each Tetra device has a unique device code and a four-digit ID.\n  - Each Comms Group has a unique four-digit ID.\n- **Group Call Function:**\n  - Channels 3701 and 3702 are used for open communication and control, such as:\n    - Release of the last train by stations\n    - Managing events or delays\n    - Handling incidents or emergencies\n- **Incident Management:**\n  - In case of an incident, a Control Centre (e.g., OCC) may instruct involved parties to switch to a different talk group, like channels 3703 or 3704, for radio communications during the initial response and evacuation phases.",
        "This document discusses the use of an Incident Management channel. It specifies that this channel can be utilized by the EPIC/AEIC and staff from various Engineering disciplines during the Investigation and Recovery phases. The purpose is to facilitate communication between these teams and the Incident Officer (IO).\nAdditionally, it advises that during incident management, all personnel should minimize radio usage to prevent network overload.",
        "POC Project for SBST on RC COMMS Training - Natural voice Chatbot prompts Teaching - on Voice Protocol, Syntax, and Practice\nOBJECTIVE\nDevelop a RC Comms Cloud-Based Trainer adopting LLM AI, so that :\n- trainee can learn and practice to communicate efficiently using TETRA HandPortable Radio, and- trainees can develop correctly voice protocol and develop good habits andpractices to follow the Rules and Procedures for radio comms in SBST Railoperating environment.\n . . and  effectively applied in much a self-learning manner.\nAPPROACH\nSBST Rails usage of RC Comms over TETRA spans the entire company-wide operations and forthe interest of conducting simulation training. ",
        "company-wide operations and forthe interest of conducting simulation training.  It is therefore best to organise it in 3 principlegroups; casually known as talk-groups; ie Operations, Station, and Engineering / Depot. As thethe POC is suppose to lead-on to a full scope for training the operations staff from a completenewbie to full competency, in their respective area of ops, it will mean examining the full contextof use cases, the learning progression, and the unique verbiages being applied and practiced ineach of these talk-groups. \nOrganised into three principle Talk-groups\nOperation Control\nStation Control\nEngineering Control\nIn order to cover the full spectrum and continuum, it",
        "Control\nIn order to cover the full spectrum and continuum, it is hence proposed to adopt this Frameworkto build the Training System.  But before that, the trainees will also need to be inducted in someform of theory; the syntax of RC comms, sentence structure, and use of catchphrases,abbreviations etc.  These will be in the form of more traditional interactive teaching modules.  Theconcept of this will be demonstrated a a slice of application in this POC, but the full functionalitywill only be developed at subsequent implementation phase.  \nTo support this, the RC AI assisted Sim Learning and Practice",
        "support this, the RC AI assisted Sim Learning and Practice (RC AI SLP, or in short ‘RC-SLP’)will be developed in this Proof of Concept (POC) along this lines, adopting this Framework;\nOperation Control\nStation Control\nEngineering Control\nOCC (default), TC, etc..\nSM (default), ASM, etc..  Depot (default),\nCall-signs &Personas in Control :\nUsers group  :\nCSO (Default), TPO, etc.  CSO (Default), etc.\n Mar 2024 (after SME inputs 15  Mar)- RC SLP\nEngineering, etc..\nEPIC (default), Engineer,technician, etc.\nPage 1 of 11AVPL\nI   Basic Levels\nComms syntax, habits, practices, Check-out etc. (similar for all except call-\nsigns)\nII  Intermediate Level  Procedural routines in\nTrain Operations\nStation’s Proceduralroutines\nEngineering workroutines coordination\nIII Advance",
        "Level  Procedural routines in\nTrain Operations\nStation’s Proceduralroutines\nEngineering workroutines coordination\nIII Advance Level\nKnown incident handling  Known incident handling  Known incident handling\nThis 3 x 3 matrix above, illustrates the progression of personnel being trained in each talk-group. The intent is not to make the communication training & practices across to be mutually exclusive,but rather is for individuals to master the Comms conducted in each operating scenario quicklybase on their familiarity, and what they can easily identify with.  Comms practices however in theRC-SLP can later evolve into a more multi-disciplinary conversational context, in as much as ahuman intelligence can be mimicked",
        "context, in as much as ahuman intelligence can be mimicked within the AI platform.    \nThere is also a desire for SBST to conduct auditing functions within this ‘System’.  This needarises as a result of the requirement for SBST to submit a monthly audit report of 80 hours sampleof comms transcript to LTA.  To ensure that this function can be incorporated at implementationphase, a pilot run on the accuracy of the Voice-to-Text transcription will be done with todaysstate-of-the-art AI application, and an assessment on the practicality for converting them in a costeffectively manner, investigating on a",
        "for converting them in a costeffectively manner, investigating on a bolt-on application to do the analysis of bad RC commsinstances (errors or problems), attributing them to : a) wrong usage or improper call-signs, b)wrong RC protocol and verbiage and c) poor comms clarity, etc.   Limitations that can be seenupfront at this stage can be the inability of AI to handle the transcription job 100% of the time,due to user’s voice accents and speech itself.  But although is not an issue with the SLP function,as it’s intend is in correcting the trainee to speech, the ’Auditor’s’ role is",
        "in correcting the trainee to speech, the ’Auditor’s’ role is to resolute betweencontext problem vs clarity instances.  And as for the latter, it will always transcribe base on itsbest ‘understanding’ of the audio be it completely fitting the context or not.   \nDeliverable Modules in RC Sim\nA)  Teaching Portion - RC Comms Theory (only in PILOT Phase) :\n.  Explain semi-duplex comms and rules (examples, one person talk at a time, pause\nof 2 secs before another speaks, etc..)\n.  Use of key-words and phrases, acronyms and abbreviations - a dictionary ofthem; verbalising and pronouncing them; and their",
        "- a dictionary ofthem; verbalising and pronouncing them; and their application meaning.\n.  Reading (pronouncing) of phonetics and numbers and time in a proper manner.4.\nIntroducing the different Operating Groups and established calls-signs - of userswithin (control stations, mobile control and different sets of users)\n.  Learn sentence structure and syntax - show examples of forms and format.6.  Technical jargons and nomenclatures (specific to talk groups) - through reading\nand picture references\nThis will eventually an interactive video/audio multi-modality play-out; and scope mayalso be extended to the use of TETRA handset hardware. 17 Mar 2024 (after SME inputs 15  Mar)- RC",
        "17 Mar 2024 (after SME inputs 15  Mar)- RC SLP\nPage 2 of 11AVPL\nB) RC SLP (which is the POC’s core) :\nPartitioned to 3 Different Comms Talk-group - a) Station Manager Control, b) EngineeringControl, c) OCC.  Hence, at the User App Landing Page, these selection will be featured.(Different AI persona with its designated Avatar will be adopted for eachController/Control Centre).\nTrainees will be able to select and progress themselves through each level of Practices:\nI.   Basic levels - \nInitial check in, comms check etc.., simple tasks like asking permission and check-out (with proper and right call-signs). \nII.  ",
        "and check-out (with proper and right call-signs). \nII.   Intermediate level -\nStandard work routines and contextual rules programmed in AI (RAM willknow, as it will be provided the practices; wait time, and responding torequest for pause etc..); That Ram is able to play out the requirements andexpectations.\nIII.  Advance level (POC  this will be sampled) - \nAI will randomly select from pre-loaded storyboard (each pre-written with thehelp of SME) for the context of a simulated play-out, example is there is amini incident of a train defect in AM mode, and it overshoot the PSD.  Thereis an expected",
        "mode, and it overshoot the PSD.  Thereis an expected unfolding of events and sequence and hence, how partiesinvolved (OCC and CSO) will respond. \nScope of POC\nThe SLP Trainer is constructed for the trainee to conduct RC comms with the AI Chat Bot througha smart phone application.  Different scenarios are created along with the other dialogue parties,one at a time, taking on different persona, and driven by AI in the respective talk-group.  Itassumes and takes on the identity at the moment the user or trainee choses the lesson plan /scenario.  The AI will follow the voice protocol",
        "plan /scenario.  The AI will follow the voice protocol and practices as it has ‘learnt’, and thereby promptthe trainees to do likewise.\nThe SLP will developed in the perspective of “Users”\nOperation Control\nStation Control\nEngineering Control\nCall-signs & Personas ofControl :\nOCC (default) TC, etc..\nSM (default), ASM, etc..  Depot 01 (default), etc..\nUsers identified :\nCSO and TPO\nCSO\nEPIC\nI   Basic Levels\nComplete\nComplete\nComplete\n Mar 2024 (after SME inputs 15  Mar)- RC SLP\nPage 3 of 11AVPL\n II  Intermediate Level\n to 5 routines (shouldbe sufficient)\n routines (sampling)\n routine (sampling)\nIII Advance Level\n incident (samplingstoryboard)\n incident (samplingstoryboard)\nGeneral Rules for the SLP Trainer\nAlthough the POC is not covering the",
        "for the SLP Trainer\nAlthough the POC is not covering the ‘Teaching of Theory’, all the General Rules in RC Commswill have to be embodied into the SLP Trainer : \n.  All parties must identify themselves with discrete call-sign (structure).2.  Parties involved must practice 2-way, half-duplex communication; ie. only one party speaks at\na time, and pause for 2 seconds before the other can speak.\n.  All messages must be clear, concise and to the point. Both the recipients and the caller must\nunderstand the messages correctly, and make clarification if required. \n.  When using the radio for communications, standard",
        "required. \n.  When using the radio for communications, standard radio protocol (voice procedure) must be\nused and strictly adhered to at all times.\n.  All radio voice messages must be in English and the use of expletives is prohibited.6.  Only use acronyms as authorised by SBST in the comms manual are to be used.7.  Radio comms are performed only on a need basis. Particularly for Technical and Operations\ncoordinations, and should not be used for social or personal matters.\n.  Radio check is used as a way of checking in when user first ‘enters’ a new talk group (switchchannel).",
        "in when user first ‘enters’ a new talk group (switchchannel).  This is particularly important in situation; example, where a CSO switch over fromtalk group 3700 to 3701 with mainline intending to communicate with the Traffic Controller,when the train is at the Reception Track. \n.  All radio voice messages concerning safety critical work including manual train movement\ncontrol must include the use of “Read Back” message.\n. A radio message for an individual manual train movement must be sent to one addressee\nonly. The Read Back protocol must be applied to ensure critical action is clearly understood.11. Misuse of ‘emergency calls’ including",
        "critical action is clearly understood.11. Misuse of ‘emergency calls’ including the emergency call function, on radio sets is prohibited.12. Staff performing train driving or manning duty shall register his radio number with the DTC, TCor duty SM (if control has been delegated to the station) by performing a radio check andestablishing radio contact before commencing train movement into the depot ATO area, intoand on the mainline.\n. When making initial contacts with Control, User has to identify himself (his own call-sign), and\naddressing the receiver or control, and then state the purpose of the call.\nAll these along with the other rules and",
        "of the call.\nAll these along with the other rules and relevant terminologies will also be captured and appliedas the ‘Right Habits’ and ‘Rules’ for the SLP portion.  This allows the AI Bot to persistentlymaking the voice comms corrections to ‘train’ the user in the cause of Comms Dialogue.\nHardware, Firmware and Cloud support \nThe computer system requirements this POC Project for an operation training chatbot isbased on the anticipated complexity and flexibility desired, the technologies and\n Mar 2024 (after SME inputs 15  Mar)- RC SLP\nPage 4 of 11AVPL\nframeworks also caters to the possible desire of upscaling the immediate validationdeployment.",
        "caters to the possible desire of upscaling the immediate validationdeployment.  Henceforth the proposed support and hardware specifications:\na.  Development Machine - for development purposes, a standard desktop computer\nwith a core i7 processor and 32GB RAM with a solid-state drive (SSD), withWindows 11 OS, is good for overall performance.  As the chatbot involves traininglarge language models (LLM), a computer with a dedicated NVIDIA GPU, such asthose from the GeForce GTX can significantly accelerate the training process.b.  Development Tools - depending on the final decision the final development carriesus to, we will for the moment us such service provider",
        "to, we will for the moment us such service provider that taps on the texting LLMsuch as Chat GPT.  We are unlikely needing to use such specific Pythonprogramming tools and code editor for POC.\nc.  Internet Connection - only a reliable and reasonably fast internet connection is\nsuffice since, it is for internal training deployment.  And for POC it is intended to behosted on cloud platform, the requirements will however may differ subsequentlyin final deployment.  Also, there is no need for web-based interface, at themoment.\nd.  Text Editors or integrated development environment (IDE) may be a crucial\ninterfaces for",
        "or integrated development environment (IDE) may be a crucial\ninterfaces for future development, and it has to match the programming language.\nThe Trainer is constructed for the trainee to conduct RC comms with the AI Chat Botthrough a smart phone application.  Different scenarios are created along with the otherdialogue party having different persona being driven by AI in the respective talk-group. The UI and UX provides for the identity at the moment the user/trainee choses the lesson/ scenario.  The AI will follow the voice protocol and practices and thereby allowing thetrainees to be prompted to do likewise.\n Mar 2024 (after",
        "thetrainees to be prompted to do likewise.\n Mar 2024 (after SME inputs 15  Mar)- RC SLP\nPage 5 of 11AVPL\nPractice Portion - levels of practices defined :\nThree different levels of Practice Training cuts across and are similar for all the 3 talk-groups.Throughout, the SLP will make ‘corrections’ of the trainer dialogue is as illustrated ..\nPlayer (TPO)\nChatbot AI (as OCC), resolute and prompts\nUnrecognisable chatter [ fails to identifyhimself ]\nStation unknown, Mainline 01 here, please identify/ say call-\nsign, Over\nMainline 01 . .\nStation unknown, Mainline 01 here, please identify/ say call-\nsign, Over\nMainline 01, TPO ‘George’ \nTPO George, Mainline 01 here, please use proper",
        "TPO ‘George’ \nTPO George, Mainline 01 here, please use proper VoiceProtocol, says ‘Over’ after you are finish.  Over\nMainline 01, TPO ‘George’, I am atStation ’twenty’ over.\nTPO George, Mainline 01 here, please use proper NumericalPhonetics, Over.\nMainline 01, TPO ‘George’ I need torecognise \nTPO George, Mainline 01 here, please use proper Phonetics,Over.\nBasic Level Practice :\nThis level of Practice Training cuts across, and are similar for all the 3 talk-groups, except that thecall-signs and message context are slightly different. Mainly to practice what is being ‘learnt’ inthe earlier ‘Teaching Module’.\nGOOD Comms PRACTICES and HABITS :\nBasic Comms Syntax and Sentence structure in RC",
        "and HABITS :\nBasic Comms Syntax and Sentence structure in RC comms:\nA) Making a Group Call (only by control centre, not individuals), Sender start by saying:\n<Receiver’s Call Sign> this is <Sender’s Call Sign>, <Message . . >, over<Car 45> this is <Mainline 01>, <Message . . >, over\nB) Individuals establishing a Call\nReceiver’s Radio call alert sounded, Receiver respond just by saying:<Receiver’s Call Sign>, send, over<Car 45>, send, over\nC) Subsequent Radio messages between the receiver and sender should just start withyour own call sign; and finally ending the last with ‘out’.\n<Your own Call Sign> < …Your Message… >, over<Car 45>, <Message .",
        "Call Sign> < …Your Message… >, over<Car 45>, <Message . . >, over\nD) Leaving Radio comms b sender should just ending with ‘over and out’.\n<Your own Call Sign> < …Your Message… >, over\n Mar 2024 (after SME inputs 15  Mar)- RC SLP\nPage 6 of 11AVPL\n<Car 45>, <Message . . >, over and out.\nWhen talking:\n• Maintain a natural rhythm • Keep a constant speed, slightly slower than in normal conversation• Speak every word clearly, do not let the voice fade away & do not shout.• Use a higher pitch tone to allow better transmission.\nGuides for User for good RC Comms:\nSpecify",
        "to allow better transmission.\nGuides for User for good RC Comms:\nSpecify upfront - Purpose of call (example - “Asking / Request” for permission for entering track)\nExample of clear purpose:\nDoing maintenance, repair, search for itemRespond to rescue a trainFollowing orders or instruction (with authority from ..)\nIf too vague? Or incomplete details for normal deployment, AI agent taking on ControlCentre persona, will prompt TPO to ask :\nWhen? .. specific time, or minutes from present timeWhere ? Present location ?Number of personnel?Reason for ..\nOther Voice Protocol and Practices:\nNot to be too apologetic, and disband with excessive nicety (such as “please, can you?”“how great if",
        "with excessive nicety (such as “please, can you?”“how great if you can ..”, etc), Otherwise Control will initiate, ‘Over and Out’ to terminaterecurring counter acknowledgement. \nResponse by Control (control centre persona):\nMust also follow similarly follow proper voice protocol,And always stands to be corrected,Lead the dialogue in each (intended) scenario.  Example: In specific scenario, such asseeking entrance for Track Access; OCC has to also follow though to provide (after he issatisfied, and ready to grant authorisation):TOA number xxxx, and state:Time limit (period in minutes, or up to a specific time)Method of Track Access Protection (Standing Train Protection, .. etc)Lastly, make",
        "of Track Access Protection (Standing Train Protection, .. etc)Lastly, make reminder to TPO to update progress.\nPractices in RC Voice Comms:\nStructured communication practices:Order of Phraseology :\nStart with call in the Party, followed by one-self End with “over”\nKeep conversation clear and brief, and practice affirmation and confirmation \nMake relevant reminders:\n Mar 2024 (after SME inputs 15  Mar)- RC SLP\nPage 7 of 11AVPL\nProceed with caution. Notify once operation/work is complete.\nAdopt Common Catch Phrases / Words (List B) :\nNegative, Positive, Wilco, Roger, go-ahead, copy thatSay again, Affirmative, at location / positionRequest additional time, extension, use as TOA\nTrade specific and standard terminologies (example List",
        "extension, use as TOA\nTrade specific and standard terminologies (example List A1 for Operations) :\nReferrals: such as OCC, TPO, Situations: Train disruption, trespassing, intrusions, SPAD, inclement weather,equipment malfunction, track damage. \nIn the half-Duplex (one way communication - means at anyone time), only one personcan talk, Parties will also need to practice 2 sec spacing and speak only the other partysays; “over” or “out”.\nHence, it is important to say OVER or OUT after parties have finished talking sothat other radio users in the Talk Group can start their own radio conversation.• OVER means you had completed your message transmission and now your\ncounterparty",
        "means you had completed your message transmission and now your\ncounterparty can start his message transmission to you.\n• OUT in a Group Call setting (Open Channel) means you had completed your\nradio conversation with your intended counterparty, now other radio users in thisTalk Group can use it to made radio call to others in the same Talk Group.• OUT in an Individual Call setting means you had completed your message\ntransmission to your intended counterparty, the radio conversation is completedno further reply is required, radio conversation had ended.\n‘Read Back Message’ practice is specifically important to ensure that a message hasbeen correctly understood and",
        "important to ensure that a message hasbeen correctly understood and received, and has to be applied in all these situations:\n.  Safety situation 2.  Protection arrangements3.  Possession & worksite boundaries4.  Change of vehicle operation modes; between AM, CM or RM5.  Movements of vehicles6.  Position of switch eg: Normal or Reverse7.  OCS status ON/OFF\n Mar 2024 (after SME inputs 15  Mar)- RC SLP\nPage 8 of 11AVPL\nIntermediate level Training \nThe voice comms habits and practices in the ‘Basic Level’ will be snowballed to this phase aswell.  But the ‘practice’, again in this level is",
        "aswell.  But the ‘practice’, again in this level is divided into the 3 talk-groups will be be listed andordered by the selection of different SOPs, and /  randomised standardised processes and worksequences as below.  There are also arranged in the 3 principal talk-groups for the purpose ofthis Training. \nOperations\nSeeking permission for Track Access (during traffic hours)Seeking permission for Track Access (during traffic hours)Moving Locomotive onto tracks\nStation Control\nValidating Authorisation for AccessArrangements for VisitsClosure of stations / entrances etc..\nDepot / Engineering\nP-way maintenanceetc..\nAn example of Intermediate Level Practices:\nSpecific Sequences of Comms with OCC (Track Access) : Sequence of events (variesand",
        "Comms with OCC (Track Access) : Sequence of events (variesand depends on Track protection methods) :[after obtaining TOA]\n-    Move to platform, and board the right assigned train,-    Make way to enter restricted area,-    Entering track,-    Report start of work (provide regular update)-    Report work complete-    Report leaving track-    Report giving up (surrendering) TOA\n Mar 2024 (after SME inputs 15  Mar)- RC SLP\nPage 9 of 11AVPL\nAdvance level Training\nThis level of practice incorporates situation relevancy in event, incidents or emergencies.",
        "of practice incorporates situation relevancy in event, incidents or emergencies.  Andthese are incorporated through storyboards provided for each scenarios.  These written scenariosand multiple variations of it will be uploaded into the AI Model for guiding the sequence ofresponse being led by the AI Bot in the SLP:\nExamples  :\nOperations Situations: SPAD, Inclement weather, etc ..\nStation Control Situations:\nTrain disruption, Trespassing, Intrusions,etc ..\nDepot / Engineering Situations:Track damage.Point machine malfunction,etc ..\nThere are also other matters involving work practices arrangements tied to each of the incidentsor events that will drive the play-out of the different scenarios in both Intermediate and AdvanceLevel.\nWORK PRACTICES",
        "of the different scenarios in both Intermediate and AdvanceLevel.\nWORK PRACTICES for Intermediate and Advance Level Training :\nTake note :\nBESIDES CALL-SIGNS, each Tetra device do have an individual device code, a four digit ID, and Each Comms Group has an individual Comms Group four digit ID.\nAlthough there is Group Call function, in the respective channel ID groups, group call function(“Open Channel” communication) on 3701 and 3702 can be used for broadcasting and by‘Control’ for instances such as :\n-  Release of the Last Train by stations -  Managing an event or delay-  Incident or Emergency\nIn the event of an",
        "or delay-  Incident or Emergency\nIn the event of an incident, one Control Centre in a talk group (eg. OCC) may instruct partiesdirectly involved in handling the incident to switch to another talk group, such as the IncidentManagement channel 3703 or 3704 for radio communications during the Initial Response andEvacuation phase.  \n Mar 2024 (after SME inputs 15  Mar)- RC SLP\nPage 10 of 11AVPL\nThis Incident Management channel may also be used by the EPIC / AEIC and staff from therespective Engineering disciplines during the Investigation and Recovery phase forcommunications between themselves and the IO.\nDuring the incident management, all",
        "forcommunications between themselves and the IO.\nDuring the incident management, all personnel should minimise use of the radio to avoid networkoverloading. \n Mar 2024 (after SME inputs 15  Mar)- RC SLP\nPage 11 of 11AVPL"
    ]
}